{
  "version": "1.0.0",
  "dependencies": ["spellData"],
  "patch": true,
  "spells": [
    {
      "name": "Abi-Dalzim's Horrid Wilting",
      "description": "You draw the moisture from every creature in a 30-foot cube centered on a point you choose within range. Each creature in that area must make a Constitution saving throw. Constructs and undead aren't affected, and plants and water elementals make this saving throw with disadvantage. A creature takes 15d8 necrotic damage on a failed save, or half as much damage on a successful one.",
      "higherLevel": "When you cast this spell using a spell slot of 9th level, the damage increases by 1d8.",
      "save": {
        "ability": "Constitution",
        "damage": "15d8",
        "damageType": "necrotic",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Acid Fog",
      "description": "You create a 20-foot-radius sphere of acidic, green fog centered on a point you choose within range. The fog spreads around corners. It lasts for the duration or until strong wind disperses the fog, ending the spell. Its area is heavily obscured.\nWhen a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a Constitution saving throw. The creature takes 5d8 acid damage on a failed save, or half as much damage on a successful one. Creatures are affected even if they hold their breath or don't need to breathe.\nThe fog moves 10 feet away from you at the start of each of your turns, rolling along the surface of the ground. The vapors, being heavier than air, sink to the lowest level of the land, even pouring down openings.",
      "higherLevel": "When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.",
      "emote": "creates a sphere of acidic, green fog",
      "source": "houserules",
      "range": "120 ft",
      "target": "a creature who enters the spell's area for the first time on a turn or starts its turn there",
      "aoe": "20 ft radius sphere centered on a point within range",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "up to 10 minutes",
      "concentration": true,
      "castingTime": "1 action",
      "level": 6,
      "school": "Conjuration",
      "save": {
        "ability": "Constitution",
        "damage": "7d8",
        "damageType": "acid",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Acid Splash",
      "description": "You hurl a bubble of acid. Choose one creature within range, or choose two creatures within range that are within 5 feet of each other. A target must succeed on a Dexterity saving throw or take 1d8 acid damage.",
      "higherLevel": "This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
      "save": {
        "ability": "Dexterity",
        "damage": "((@{level} + 1) / 6 + 0.5)d8",
        "damageType": "acid"
      }
    },
    {
      "name": "Acidic Spray",
      "description": "An acidic spray erupts from your hands. Each creature in a 60-foot cone must make a Constitution saving throw. A creature takes 8d8 acid damage on a failed save, or half as much damage on a successful one.\nA creature killed by this spell is affected by rigor mortis.",
      "higherLevel": "When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.",
      "emote": "'s hands erupt with an acidic spray",
      "source": "houserules",
      "range": "Self",
      "target": "each creature in the aoe",
      "aoe": "60 ft cone",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "an Ankheg's mandible"
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 5,
      "school": "Evocation",
      "save": {
        "ability": "Constitution",
        "damage": "8d8",
        "damageType": "acid",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Aggressive Thundercloud",
      "description": "A 5-foot-diameter sphere of crackling storm clouds appears in an unoccupied space of your choice within range and lasts for the duration. Any creature that ends its turn within the cloud must make a Dexterity saving throw. The creature takes 2d6 lightning damage on a failed save, or half as much damage on a successful one. As a bonus action, you can make the sphere fly up to 30 feet. If the sphere enters space that contains a creature, that creature must make the saving throw against the sphere's damage, and the sphere stops moving this turn.",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d6 for each slot level above 2nd.",
      "emote": "conjures a sphere of crackling storm clouds",
      "source": "houserules",
      "range": "60 ft",
      "target": "Any creature that ends its turn within the cloud",
      "aoe": "5 ft diameter sphere in an unoccupied space within range",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a piece of tree struck by lightning"
      },
      "duration": "up to 1 minute",
      "concentration": true,
      "castingTime": "1 action",
      "level": 2,
      "school": "Conjuration",
      "save": {
        "ability": "Dexterity",
        "damage": "2d6",
        "damageType": "lightning",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Druid",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Aura of Vitality",
      "school": "Necromancy"
    },
    {
      "name": "Banishment",
      "description": "You attempt to send one creature that you can see within range to another plane of existence. The target must succeed on a Charisma saving throw or be banished.\nIf the target is native to the plane of existence you're on, you banish the target to a harmless demiplane. While there, the target is incapacitated. The target remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied.\nIf the target is native to a different plane of existence than the one you're on, the target is banished with a faint popping noise, returning to its home plane. If the spell ends before 1 minute has passed, the target reappears in the space it left or in the nearest unoccupied space if that space is occupied. Otherwise, the target doesn't return. Any creature who is not native to another plane can repeat the saving throw at the end of each turn, returning on a success."
    },
    {
      "name": "Banishing Smite",
      "description": "The next time you hit a creature with a weapon attack before this spell ends, your weapon crackles with force, and the attack deals an extra 5d6 force damage to the target. Additionally, if this attack reduces the target to 50 hit points or fewer, you banish it. If the target is native to a different plane of existence than the one you're on, the target disappears, returning to its home plane. If the target is native to the plane you're on, the creature vanishes into a harmless demiplane. While there, the target is incapacitated. It remains there until the spell ends, at which point the target reappears in the space it left or in the nearest unoccupied space if that space is occupied.",
      "damage": {
        "damage": "5d6",
        "damageType": "force",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Beacon of Hope",
      "duration": "1 minute",
      "concentration": false
    },
    {
      "name": "Blight",
      "description": "Necromantic energy washes over a creature of your choice that you can see within range, draining moisture and vitality from it. The target must make a Constitution saving throw. The target takes 12d8 necrotic damage on a failed save, or half as much damage on a successful one. The spell has no effect on undead or constructs.\nIf you target a plant creature or a magical plant, it makes the saving throw with disadvantage, and the spell deals maximum damage to it.\nIf you target a nonmagical plant that isn't a creature, such as a tree or shrub, it doesn't make a saving throw; it simply withers and dies.",
      "save": {
        "ability": "Constitution",
        "damage": "12d8",
        "damageType": "necrotic",
        "saveSuccess": "half damage",
        "higherLevelDice": "2"
      }
    },
    {
      "name": "Blur",
      "duration": "up to 10 minutes"
    },
    {
      "name": "Bones of the Earth",
      "description": "You cause up to six pillars of stone to burst from places on the ground that you can see within range. Each pillar is a cylinder that has a diameter of 5 feet and a height of up to 30 feet. The ground where a pillar appears must be wide enough for its diameter, and you can target ground under a creature if that creature is Medium or smaller. Each pillar has AC 5 and 30 hit points. When reduced to 0 hit points, a pillar crumbles into rubble, which creates an area of difficult terrain with a 10-foot radius. The rubble lasts until cleared.\nIf a pillar is created under a creature, that creature must succeed on a Dexterity saving throw or be lifted by the pillar. A creature can choose to fail the save.\nIf a pillar is prevented from reaching its full height because of a ceiling or other obstacle, a creature on the pillar takes 8d6 bludgeoning damage and is restrained, pinched between the pillar and the obstacle. The restrained creature can use an action to make a Strength or Dexterity check (the creature's choice) against the spell's saving throw DC. On a success, the creature is no longer restrained and must either move off the pillar or fall off it.",
      "save": {
        "ability": "Dexterity",
        "damage": "8d6",
        "damageType": "bludgeoning"
      }
    },
    {
      "name": "Blinding Smite",
      "description": "The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon flares with bright light, and the attack deals an extra 4d6 radiant damage to the target. Additionally, the target must succeed on a Constitution saving throw or be blinded until the spell ends.\nA creature blinded by this spell makes another Constitution saving throw at the end of each of its turns. On a successful save, it is no longer blinded.",
      "damage": {
        "damage": "4d6",
        "damageType": "radiant",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Branding Smite",
      "description": "The next time you hit a creature with a weapon attack before this spell ends, the weapon gleams with astral radiance as you strike. The attack deals an extra 3d6 radiant damage to the target, which becomes visible if it's invisible, and the target sheds dim light in a 5-foot radius and can't become invisible until the spell ends.",
      "damage": {
        "damage": "3d6",
        "damageType": "radiant",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Burst With Light",
      "description": "A creature you can see within range becomes filled with intense magical light as the light bursts from its wounds and orifices. The creature radiates bright light in a 30-foot radius and dim light for an additional 30 feet.\nFor the duration at the start of its turn the creature must make a Constitution saving throw. It takes 5d8 radiant damage on a failed save, or half as much damage on a successful one. An undead creature has disadvantage on this saving throw. On a successful save, the spell ends.\nAny creature within 5 feet of the creature when it takes this damage must also succeed on a Consitution saving throw or take the damage specified above and be blinded for until the end of their next turn.",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
      "emote": "causes a creature to be filled with intense magical light as the light bursts from its wounds and orifices",
      "source": "houserules",
      "range": "60 ft",
      "target": "a creature within range",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "up to 1 minute",
      "concentration": true,
      "castingTime": "1 action",
      "level": 1,
      "school": "Evocation",
      "save": {
        "ability": "Constitution",
        "damage": "5d8",
        "damageType": "radiant",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Cleric",
        "Paladin"
      ]
    },
    {
      "name": "Call Lightning",
      "description": "A storm cloud appears in the shape of a cylinder that is 10 feet tall with a 60-foot radius, centered on a point you can see 100 feet directly above you. The spell fails if you can't see a point in the air where the storm cloud could appear (for example, if you are in a room that can't accommodate the cloud).\nWhen you cast the spell, choose a point you can see within range. A bolt of lightning flashes down from the cloud to that point. Each creature within 5 feet of that point must make a Dexterity saving throw. A creature takes 3d8 lightning damage on a failed save, or half as much damage on a successful one. On each of your turns until the spell ends, you can use your action to call down lightning in this way again, targeting the same point or a different one.\nIf you are outdoors in stormy conditions when you cast this spell, the spell gives you control over the existing storm instead of creating a new one. Under such conditions, the spell's damage increases by 1d10.",
      "higherLevel": "When you cast this spell using a spell slot of 4th or higher level, the damage increases by 1d8 for each slot level above 3rd.",
      "save": {
        "ability": "Dexterity",
        "damage": "3d8",
        "damageType": "lightning",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Catapult",
      "description": "Choose one object weighing 1 to 5 pounds within range that isn't being worn or carried. The object flies in a straight line up to 90 feet in a direction you choose before falling to the ground, stopping early if it impacts against a solid surface. If the object would strike a creature, that creature must make a Dexterity saving throw. On a failed save, the object strikes the target and stops moving. In either case, both the object and the creature or solid surface take 3d10 bludgeoning damage.",
      "higherLevel": "When you cast this spell using a spell slot of 2nd level or higher, the maximum weight of objects that you can target with this spell increases by 5 pounds, and the damage increases by 1d10, for each slot level above 1st.",
      "save": {
        "ability": "Dexterity",
        "damage": "3d10",
        "damageType": "bludgeoning",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Chill Touch",
      "description": "You create a ghostly, skeletal hand in the space of a creature within range. Make a ranged spell attack against the creature to assail it with the chill of the grave. On a hit, the target takes 1d10 necrotic damage, and it can't regain hit points until the start of your next turn. Until then, the hand clings to the target.",
      "higherLevel": "This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
      "range": "90 ft",
      "attack": {
        "type": "ranged",
        "damage": "((@{level} + 1) / 6 + 0.5)d10",
        "damageType": "necrotic"
      }
    },
    {
      "name": "Cloud of Acid",
      "description": "You fill the air with an acidic cloud in a 5-foot-radius, centered on a point you choose within range. A creature takes 4d4 acid damage when it enters the spell's area for the first time on a turn or starts its turn there.",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 2d4 for each slot level above 2nd.",
      "emote": "fills the the air with an acidic cloud",
      "source": "phb 222",
      "range": "60 ft",
      "target": "a creature who enters the spell's area for the first time on a turn or starts its turn there",
      "aoe": "5 ft radius centered on a point within range",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a small poisonous beetle"
      },
      "duration": "up to 1 minute",
      "concentration": true,
      "castingTime": "1 action",
      "level": 2,
      "school": "Conjuration",
      "damage": {
        "damage": "5d4",
        "damageType": "acid",
        "higherLevelDice": "2"
      },
      "classes": [
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "name": "Cloud of Daggers",
      "description": "You fill the air with spinning daggers in a 5-foot-radius, centered on a point you choose within range. A creature takes 4d4 slashing damage when it enters the spell's area for the first time on a turn or starts its turn there.",
      "aoe": "5 ft radius centered on a point within range"
    },
    {
      "name": "Cloudkill",
      "description": "You create a 20-foot-radius sphere of poisonous, yellow-green fog centered on a point you choose within range. The fog spreads around corners. It lasts for the duration or until strong wind disperses the fog, ending the spell. Its area is heavily obscured.\nWhen a creature enters the spell's area for the first time on a turn or starts its turn there, that creature must make a Constitution saving throw. The creature takes 6d8 poison damage on a failed save, or half as much damage on a successful one. Creatures are affected even if they hold their breath or don't need to breathe.\nThe fog moves 10 feet away from you at the start of each of your turns, rolling along the surface of the ground. The vapors, being heavier than air, sink to the lowest level of the land, even pouring down openings.",
      "save": {
        "ability": "Constitution",
        "damage": "6d8",
        "damageType": "poison",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Color Spray",
      "description": "A dazzling array of flashing, colored light springs from your hand. Roll 6d10; the total is how many hit points of creatures this spell can effect. Creatures in a 15-foot cone originating from you are affected in ascending order of their current hit points (ignoring unconscious creatures and creatures that can't see).\nStarting with the creature that has the lowest current hit points, each creature affected by this spell is blinded until the spell ends. Subtract each creature's hit points from the total before moving on to the creature with the next lowest hit points. A creature's hit points must be equal to or less than the remaining total for that creature to be affected. At the end of each affected creature's turns, the creature can make an Intelligence saving throw. If it succeeds, this effect ends for that target.",
      "duration": "1 minute"
    },
    {
      "name": "Conjure Barrage",
      "description": "You throw a nonmagical weapon or fire a piece of nonmagical ammunition into the air to create a cone of identical weapons that shoot forward and then disappear. Each creature in a 40-foot cone must succeed on a Dexterity saving throw. A creature takes 5d8 damage on a failed save, or half as much damage on a successful one. The damage type is the same as that of the weapon or ammunition used as a component.",
      "higherLevel": "When you cast this spell using a spell slot of 4th level or higher, the base damage increases by 1d6 for each slot level above 3rd.",
      "aoe": "40 ft cone",
      "save": {
        "ability": "Dexterity",
        "damage": "5d8",
        "damageType": "same as that of the weapon or ammunition used as a component",
        "higherLevelDice": "1",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Conjure Volley",
      "description": "You fire a piece of nonmagical ammunition from a ranged weapon or throw a nonmagical weapon into the air and choose a point within range. Hundreds of duplicates of the ammunition or weapon fall in a volley from above and then disappear. Each creature in a 40-foot-radius. 20-foot-high cylinder centered on that point must make a Dexterity saving throw. A creature takes 6d8 damage on a failed save, or half as much damage on a successful one. The damage type is the same as that of the ammunition or weapon.",
      "save": {
        "ability": "Dexterity",
        "damage": "6d8",
        "damageType": "same as that of the weapon or ammunition used as a component",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Continual Flame",
      "ritual": true
    },
    {
      "name": "Cordon of Arrows",
      "description": "You plant four pieces of nonmagical ammunition-arrows or crossbow bolts-in the ground within range and lay magic upon them to protect an area. Until the spell ends, whenever a creature other than you comes within 30 feet of the ammunition for the first time on a turn or ends its turn there, one piece of ammunition flies up to strike it. The creature must succeed on a Dexterity saving throw or take 3d6 piercing damage. The piece of ammunition is then destroyed. The spell ends when no ammunition remains.\nWhen you cast this spell, you can designate any creatures you choose, and the spell ignores them.",
      "save": {
        "ability": "Dexterity",
        "damage": "2d6",
        "damageType": "piercing"
      }
    },
    {
      "name": "Corrosive Touch",
      "description": "Corrosive acid engulfs your hand as you try to touch a creature. Make a melee spell attack against the target. On a hit, the target takes 1d12 acid damage.",
      "higherLevel": "The spell's damage increases by 1d12 when you reach 5th level (2d12), 11th level (3d12), and 17th level (4d12).",
      "emote": "'s hand is engulfed in acid",
      "range": "Touch",
      "target": "a creature",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 0,
      "school": "Conjuration",
      "attack": {
        "type": "melee",
        "damage": "((@{level} + 1) / 6 + 0.5)d12",
        "damageType": "acid"
      },
      "classes": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Create Bonfire",
      "description": "You create a bonfire on ground that you can see within range. Until the spells ends, the bonfire fills a 5-foot cube. Any creature in the bonfire's space when you cast the spell must make a Dexterity saving throw. A creature takes 1d8 fire damage on a failed save, or half as much damage on a successful one. A creature must also make the saving throw when it enters the bonfire's space for the first time on a turn or ends its turn there.",
      "save": {
        "ability": "Dexterity",
        "damage": "((@{level} + 1) / 6 + 0.5)d8",
        "damageType": "fire",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Creation",
      "description": "You create a non-magical, nonliving object of vegetable matter within range: soft goods, rope, wood, or something similar. You can also use this spell to create mineral objects such as stone, crystal, or metal. The object created must be no larger than a 5-foot cube, and the object must be of a form and material that you have seen before.\nThe duration depends on the object's material. If the object is composed of multiple materials, use the shortest duration.\nVegetable matter 1 day\nStone or crystal 12 hours\nPrecious metals 1 hour\nGems 10 minutes\nAdamantine or mithral 1 minute\nUsing any material created by this spell as another spell's material component causes that spell to fail.",
      "emote": "creates a non-magical, nonliving object of vegetable matter",
      "school": "Conjuration"
    },
    {
      "name": "Crown of Madness",
      "description": "One creature of your choice that you can see within range must succeed on a Wisdom saving throw or become charmed by you for the duration. While the target is charmed in this way, a twisted crown of jagged iron appears on its head, and a madness glows in its eyes.\nThe charmed target must use its action to make melee attacks against a creature other than itself that you mentally choose. The charmed target can move up to half its speed before making the attacks.\nThe target can act normally on its turn if you choose no creature or if none are within its reach.\nOn your subsequent turns, you must use your action to maintain control over the target, or the spell ends. Also, the target can make a Wisdom saving throw at the end of each of its turns. On a success, the spell ends.",
      "save": {
        "ability": "Wisdom"
      }
    },
    {
      "name": "Cure Wounds",
      "description": "A creature you touch regains a number of hit points equal to 2d6 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
      "higherLevel": "When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d6 for each slot level above 1st.",
      "school": "Necromancy",
      "heal": {
        "amount": "2d6",
        "castingStat": true,
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Death Ward",
      "school": "Necromancy"
    },
    {
      "name": "Destructive Wave",
      "higherLevel": "When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d6 for each slot level above 1st.",
      "save": {
        "ability": "Constitution",
        "damage": "5d6",
        "damageType": "thunder",
        "secondaryDamage": "5d6",
        "secondaryDamageType": "radiant or necrotic damage (your choice)",
        "saveSuccess": "half damage and not knocked prone",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Detect Magic",
      "description": "For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.\nIf you touch a magical item and focus on it, you have advantage on ability checks to identify it.\nIf you instead touch a creature and focus on it for 1 minute, you learn what spells, if any, are currently affecting it."
    },
    {
      "name": "Detect Poison and Disease",
      "description": "For the duration, you can sense the presence and location of poisons, poisonous creatures, diseases, and radiation within 30 feet of you. You also identify the kind of poison, poisonous creature, disease, or level of radiation in each case.\nYou see radioactive auras as a glowing green shimmer in the air that emanates from radioactive objects; the brighter and more intense the green, the more powerful the radioactivity.\nThe spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt—although radiation can seep into such barriers, causing them to become radioactive (and thus visible to the spell) in time."
    },
    {
      "name": "Discharge",
      "description": "You dissipate the charges from one technological object, temporarily depowers one electrically powered technological object that does not use charges, or severely hinders a creature with the robot subtype.\nIf the spell targets an object with charges, the object loses all of its remaining charges. If the object is powered by electrical means other than charges, its functions are suppressed for 1d4 rounds.\nIf the spell targets a creature not of the robot subtype, the target must make a Constitution saving throw or one charged or electrically powered item on their person is affected, as described above.\nIf the target is a robot, the robot must succeed on a Consitution savine throw or it suffers disadvantage on ability checks and attack rolls for 1 minute and cannot use any energy-based attacks for 1d4 rounds. An affected robot can make a new Constitution saving throw at the end of each of its turns. On a success, the effect of the spell ends.",
      "higherLevel": "When you cast this spell using a spell slot of 5th level or higher, you can target one additional object for each slot level above 3rd.",
      "emote": "dissipate the charges from one technical object",
      "source": "houserules",
      "range": "120 feet",
      "target": "one technological object or robot",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 3,
      "school": "Evocation",
      "classes": [
        "Bard",
        "Cleric",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "name": "Disguise Self",
      "higherLevel": "When you cast this spell using a spell slot of 2nd level or higher, you can target one additional humanoid for each slot above 1st."
    },
    {
      "name": "Disintegrate",
      "description": "A thin green ray springs from your pointing finger to a target that you can see within range. The target can be a creature, an object, or a creation of magical force, such as the wall created by wall of force.\nA creature targeted by this spell must make a Dexterity saving throw. On a failed save, the target takes 12d6 + 40 force damage. If this damage reduces the target to 0 hit points, it is disintegrated.\nA disintegrated creature and everything it is wearing and carrying, except magic items, are reduced to a pile of fine gray dust. The creature can be restored to life only by means of a true resurrection or a wish spell.\nThis spell automatically disintegrates a Large or smaller nonmagical object or a creation of magical force. If the target is a Huge or larger object or creation of force, this spell disintegrates a 10-foot-cube portion of it. A magic item is unaffected by this spell.",
      "save": {
        "ability": "Dexterity",
        "damage": "12d6",
        "damageBonus": "40",
        "damageType": "force",
        "saveSuccess": "half damage",
        "higherLevelDice": "3"
      }
    },
    {
      "name": "Divine Word",
      "description": "You utter a divine word, imbued with the power that shaped the world at the dawn of creation. Choose any number of creatures you can see within range. Each creature that can hear you must make a Constitution saving throw. On a failed save, a creature suffers an effect based on its current hit points:\n&#8226; 50 hit points or fewer: deafened for 1 minute\n&#8226; 40 hit points or fewer: deafened and blinded for 10 minutes\n&#8226; 30 hit points or fewer: blinded, deafened, and stunned for 1 hour\n&#8226; 20 hit points or fewer: killed instantly.\nRegardless of its current hit points, a celestial, an elemental, a fey, or a fiend that fails its save is forced back to its plane of origin (if it isn't there already) and can't return to your current plane for 24 hours by any means short of a wish spell.",
      "save": {
        "ability": "Constitution"
      }
    },
    {
      "name": "Dragon's Breath",
      "description": "You breathe out a blast of energy. Each creature in the area of the exhalation must make a saving throw, the type of which is determined by the color of dragon scale. A creature takes 9d6 damage on a failed save, or half as much damage on a successful one.\nDragon Scale  Breath Weapon  Damage Type\nBlack or Copper  5 by 60 ft. line (Dex. save)  Acid\nBlue or Bronze  5 by 60 ft. line (Dex. save)  Lightning\nBrass  5 by 60 ft. line (Dex. save) Fire\nRed or Gold  45 ft. cone (Dex. save)  Fire\nGreen  45 ft. cone (Con. save)  Poison\nWhite or Silver  45 ft. cone (Con. save)  Cold",
      "higherLevel": "When you cast this spell using a spell slot of 5th level or higher, the damage increases by 1d6 for each spell slot above 4th.",
      "emote": "breathes out a blast of energy",
      "source": "houserules",
      "range": "Self (45-foot cone or 5 by 60-foot line)",
      "target": "each creature in the aoe",
      "aoe": "45-foot cone or 5 by 60-foot line",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a dragon scale worth at least 50 gp"
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 4,
      "school": "Evocation",
      "save": {
        "ability": "Constitution",
        "damage": "9d6",
        "damageType": "acid, lightning, fire, poison, or cold",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Dust Devil",
      "description": "Choose an unoccupied 5-foot cube of air that you can see within range. An elemental force that resembles a dust devil appears in the cube and lasts for the spell's duration.\nAny creature that enters the spell's area for the first time on a turn or starts its turn within 5 ft of the dust devil must make a Strength saving throw. On a failed save, the creature takes 2d4 bludgeoning damage and is pushed 10 feet away. On a successful save, the creature takes half as much damage and isn't pushed.\nAs a bonus action, you can move the dust devil up to 30 feet in any direction. If the dust devil moves over sand, dust, loose dirt, or small gravel, it sucks up the material and forms a 10-foot-radius cloud of debris around itself that lasts until the start of your next turn. The cloud heavily obscures its area.",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d4 for each slot level above 2nd.",
      "target": "any creature that enters the spell's area for the first time on a turn or starts its turn within 5 ft of the dust devil",
      "save": {
        "ability": "Strength",
        "damage": "2d4",
        "damageType": "bludgeoning",
        "saveSuccess": "half damage and not pushed",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Earth Tremor",
      "description": "You cause a tremor in the ground in a 10-foot radius. Each creature other than you in that area must make a Dexterity saving throw. On a failed save, a creature takes 2d6 bludgeoning damage and is knocked prone. On a successful save, the creature takes half as much damage and isn't knocked prone. If the ground in that area is loose earth or stone, it becomes difficult terrain until cleared.",
      "range": "Self (30-foot cone)",
      "save": {
        "ability": "Dexterity",
        "damage": "2d6",
        "damageType": "bludgeoning",
        "saveSuccess": "half damage and not prone",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Electric Arc",
      "description": "You create a bolt of lightning that arcs toward a target of your choice that you can see within range. A bolt then leap from that target to another target, which must be within 10 feet of the first target. A target can be a creature or an object.\nA target must make a Dexterity saving throw. The target takes 2d8 lightning damage on a failed save, or half as much damage on a successful one.",
      "higherLevel": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
      "emote": "creates a bolt of lightning that arcs toward a target.",
      "source": "houserules",
      "range": "90 ft",
      "target": "a target within range and a creature within 10 ft of it. A target can be a creature or an object.",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 1,
      "school": "Evocation",
      "save": {
        "ability": "Dexterity",
        "damage": "2d8",
        "damageType": "lightning",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Eroding Mist",
      "description": "As you hold your hands with thumbs touching and fingers spread, a green mist shoots forth from your outstretched fingertips. Each creature in a 15-foot cone must make a Dexterity saving throw. A creature takes 3d6 acid damage on a failed save, or half as much damage on a successful one.\nThe acid can eat through objects in the area that aren't being worn or carried.",
      "higherLevel": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d6 for each slot level above 1st.",
      "emote": "holds {{GENDER_PRONOUN_HIS_HER}} hands with thumbs touching and fingers spread as a thin sheet of flames shoots forth from {{GENDER_PRONOUN_HIS_HER}} fingertips",
      "source": "houserules",
      "range": "Self",
      "target": "Every creature in the aoe",
      "aoe": "15 ft cone",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 1,
      "school": "Evocation",
      "save": {
        "ability": "Dexterity",
        "damage": "3d6",
        "damageType": "acid",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "name": "Eruptive Postules",
      "description": "Your skin erupts in swollen, pus-filled bumps for the duration. You can end the spell early by using an action to dismiss it. Whenever a creature within 5 feet of you hits you with a melee attack, the pustules burst open. The attacker takes 1d8 points of acid damage and must make a Constitution saving throw or be blinded until the end of it's next turn.",
      "emote": "'s skin erupts in swollen, pus-filled bumps",
      "source": "houserules",
      "range": "Self",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a small amount of oil"
      },
      "duration": "10 minutes",
      "castingTime": "1 action",
      "level": 3,
      "school": "Transmutation",
      "save": {
        "ability": "Constitution"
      },
      "classes": [
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "name": "Evard's Black Tentacles",
      "description": "Squirming, ebony tentacles fill a 20-foot square on ground that you can see within range. For the duration, these tentacles turn the ground in the area into difficult terrain. When a creature enters the affected area for the first time on a turn or starts its turn there, the creature must succeed on a Dexterity saving throw or take 4d6 bludgeoning damage and be restrained by the tentacles until the spell ends. A creature that starts its turn in the area and is already restrained by the tentacles takes 5d6 bludgeoning damage. A creature restrained by the tentacles can use its action to make a Strength or Dexterity check (its choice) against your spell save DC. On a success, it frees itself.",
      "higherLevel": "When you cast this spell using a spell slot of 5th level or higher, the base damage increases by 1d6 for each slot level above 4th.",
      "save": {
        "ability": "Dexterity",
        "damage": "4d6",
        "damageType": "bludgeoning",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Faerie Fire",
      "description": "Each object in a 20-foot cube within range is outlined in blue, green, or violet light (your choice). Any creature in the area when the spell is cast is also outlined in light if it fails a Constitution saving throw. For the duration, objects and affected creatures shed dim light in a 10-foot radius.\nAny attack roll against an affected creature or object has advantage if the attacker can see it, and the affected creature or object can't benefit from being invisible.",
      "save": {
        "ability": "Constitution"
      }
    },
    {
      "name": "Feign Death",
      "level": 2
    },
    {
      "name": "Finger of Death",
      "description": "You send negative energy coursing through a creature that you can see within range, causing it searing pain. The target must make a Constitution saving throw. It takes 12d8 + 30 necrotic damage on a failed save, or half as much damage on a successful one.\nA humanoid killed by this spell rises at the start of your next turn as a zombie that is permanently under your command, following your verbal orders to the best of its ability.",
      "higherLevel": "When you cast this spell using a spell slot of 8th level or higher, the damage increases by 1d8 for each slot level above 7th.",
      "save": {
        "ability": "Constitution",
        "damage": "12d8",
        "damageBonus": "30",
        "damageType": "necrotic",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Fire Storm",
      "description": "A storm made up of sheets of roaring flame appears in a location you choose within range. The area of the storm consists of up to eight 10-foot cubes, which you can arrange as you wish. Each cube must have at least one face adjacent to the face of another cube. Each creature in the area must make a Dexterity saving throw. It takes 7d10 fire damage on a failed save, or half as much damage on a successful one.\nThe fire damages objects in the area and ignites flammable objects that aren't being worn or carried. If you choose, plant life in the area is unaffected by this spell.",
      "aoe": "up to 8 10 ft cubes, which you can arrange as you wish at a location you choose within range. Each cube must have at least one face adjacent to the face of another cube"
    },
    {
      "name": "Fireball",
      "description": "A bright streak flashes from your pointing finger to a point you choose within range and then blossoms with a low roar into an explosion of flame. Each creature in a 20-foot-radius sphere centered on that point must make a Dexterity saving throw. A target takes 6d6 fire damage on a failed save, or half as much damage on a successful one.\nThe fire spreads around corners. It ignites flammable objects in the area that aren't being worn or carried.",
      "save": {
        "ability": "Dexterity",
        "damage": "6d6",
        "damageType": "fire",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Flame Arrows",
      "description": "You touch a quiver containing arrows or bolts. When a target is hit by a ranged weapon attack using a piece of ammunition drawn from the quiver, the target takes an extra 1d6 fire damage. The spell's magic ends on the piece of ammunition when it hits or misses. When the quiver runs out of ammunition is takes an action to fill it from another quiver.",
      "higherLevel": "When you cast this spell using a spell slot of 4th or 5th level, you can maintain your concentration on the spell for up to 8 hours. When you use a spell slot of 6th level or higher, you can maintain your concentration on the spell for up to 24 hours."
    },
    {
      "name": "Flame Strike",
      "description": "A vertical column of divine fire roars down from the heavens in a location you specify. Each creature in a 10-foot-radius, 40-foot-high cylinder centered on a point within range must make a Dexterity saving throw. A creature takes 6d6 fire damage and 6d6 radiant damage on a failed save, or half as much damage on a successful one.",
      "save": {
        "ability": "Dexterity",
        "damage": "7d6",
        "damageType": "fire",
        "secondaryDamage": "6d6",
        "secondaryDamageType": "radiant",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Frostbite",
      "description": "You cause numbing frost to form on one creature that you can see within range. The target must make a Constitution saving throw. The target takes 1d6 cold damage and it has disadvantage on the next weapon attack roll it makes before the end of its next turn on a failed save, or half as much damage on a successful one.",
      "save": {
        "ability": "Constitution",
        "damage": "((@{level} + 1) / 6 + 0.5)d8",
        "damageType": "cold"
      }
    },
    {
      "name": "Glyph of Warding",
      "description": "When you cast this spell, you inscribe a glyph that harms other creatures, either upon a surface (such as a table or a section of floor or wall) or within an object that can be closed (such as a book, a scroll, or a treasure chest) to conceal the glyph. If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If the spell is cast without consuming the powered diamond then the spell will only last an hour. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.\nThe glyph is nearly invisible and requires a successful Intelligence (Investigation) check against your spell save DC to be found.\nYou decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or standing on the glyph, removing another object covering the glyph, approaching within a certain distance of the glyph, or manipulating the object on which the glyph is inscribed. For glyphs inscribed within an object, the most commontriggers include opening that object, approaching within a certain distance of the object, or seeing or reading the glyph. Once a glyph is triggered, this spell ends.\nYou can further refine the trigger so the spell activates only under certain circumstances or according to physical characteristics (such as height or weight), creature kind (for example, the ward could be set to affect aberrations or drow), or alignment. You can also set conditions for creatures that don't trigger the glyph, such as those w ho say a certain password.\nWhen you inscribe the glyph, choose explosive runes or a spell glyph.\nExplosive Runes. When triggered, the glyph erupts with magical energy in a 20-foot-radius sphere centered on the glyph. The sphere spreads around corners. Each creature in the area must make a Dexterity saving throw. A creature takes 5d8 acid, cold, fire, lightning, or thunder damage on a failed saving throw (your choice when you create the glyph), or half as much damage on a successful one.\nSpell Glyph. You can store a prepared spell of 3rd level or lower in the glyph by casting it as part of creating the glyph. The spell must target a single creature or an area. The spell being stored has no immediate effect when cast in this way. When the glyph is triggered, the stored spell is cast. If the spell has a target, it targets the creature that triggered the glyph. If the spell affects an area, the area is centered on that creature. If the spell summons hostile creatures or creates harmful objects or traps, they appear as close as possible to the intruder and attack it. If the spell requires concentration, it lasts until the end of its full duration.",
      "castingTime": "1 minute"
    },
    {
      "name": "Grasping Shadows",
      "description": "You conjure shadows that fill a 20-foot square on the ground that you can see within range. For the duration, these shadows turn the ground in the area into difficult terrain.\nWhen a creature enters the affected area for the first time on a turn or starts its turn there, the creature must succeed on a Dexterity saving throw or take 3d6 bludgeoning damage and be restrained by the shadows until the spell ends. A creature that starts its turn in the area and is already restrained by the shadows takes 4d6 bludgeoning damage.\nA creature restrained by the shadows can use its action to make a Strength or Dexterity check (its choice) against your spell save DC. On a success, it frees itself.",
      "emote": "conjures vines that sprout from the ground",
      "source": "phb 238 / phb 246",
      "range": "90 ft",
      "target": "a creature that enters the affected area for the first time on a turn or starts its turn there",
      "aoe": "20 ft square on ground that you can see within range",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a piece of vine"
      },
      "duration": "up to 1 minute",
      "concentration": true,
      "castingTime": "1 action",
      "level": 4,
      "school": "Conjuration",
      "save": {
        "ability": "Dexterity",
        "damage": "3d6",
        "damageType": "bludgeoning"
      },
      "classes": [
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "name": "Grasping Vine",
      "newName": "Grasping Vines",
      "description": "You conjure vines that fill a 20-foot square on the ground that you can see within range. For the duration, these vines turn the ground in the area into difficult terrain.\nWhen a creature enters the affected area for the first time on a turn or starts its turn there, the creature must succeed on a Dexterity saving throw or take 3d6 bludgeoning damage and be restrained by the vines until the spell ends. A creature that starts its turn in the area and is already restrained by the vines takes 4d6 bludgeoning damage.\nA creature restrained by the vines can use its action to make a Strength or Dexterity check (its choice) against your spell save DC. On a success, it frees itself.",
      "emote": "conjures vines that sprout from the ground",
      "source": "phb 238 / phb 246",
      "range": "90 ft",
      "target": "a creature that enters the affected area for the first time on a turn or starts its turn there",
      "aoe": "20 ft square on ground that you can see within range",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a piece of vine"
      },
      "duration": "up to 1 minute",
      "concentration": true,
      "castingTime": "1 action",
      "level": 4,
      "school": "Conjuration",
      "save": {
        "ability": "Dexterity",
        "damage": "3d6",
        "damageType": "bludgeoning"
      },
      "classes": [
        "Druid",
        "Ranger"
      ],
      "archetypes": [
        "Nature"
      ]
    },
    {
      "name": "Guardian of Faith",
      "description": "A Large spectral guardian appears and hovers for the duration in an unoccupied space of your choice that you can see within range. The guardian occupies that space and is indistinct except for a gleaming sword and shield emblazoned with the symbol of your deity.\nAny creature hostile to you that moves to a space within 10 feet of the guardian for the first time on a turn must succeed on a Dexterity saving throw. The creature takes 20 radiant damage on a failed save, or half as much damage on a successful one. The guardian vanishes when it has dealt a total of 60 damage.",
      "higherLevel": "When you cast this spell using a spell slot of 5th level or higher, the base damage increases by 1d8 for each slot level above 4th.",
      "save": {
        "ability": "Dexterity",
        "damage": "20",
        "damageType": "radiant",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Guiding Bolt",
      "description": "A flash of light streaks toward a creature of your choice within range. Make a ranged spell attack against the target. On a hit, the target takes 3d8 radiant damage, and the next attack roll made against this target before the end of your next turn has advantage, thanks to the mystical dim light glittering on the target until then.",
      "higherLevel": "When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.",
      "attack": {
        "type": "ranged",
        "damage": "3d8",
        "damageType": "radiant",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Harm",
      "description": "You unleash a virulent disease on a creature that you can see within range. The target must make a Constitution saving throw. On a failed save, it takes 14d8 necrotic damage, or half as much damage on a successful save. The damage can't reduce the target's hit points below 1. If the target fails the saving throw, its hit point maximum is reduced for 1 hour by an amount equal to the necrotic damage it took. Any effect that removes a disease allows a creature's hit point maximum to return to normal before that time passes.",
      "higherLevel": "When you cast this spell using a spell slot of 6th level or higher, the base damage increases by 1d8 for each slot level above 5th.",
      "level": 5,
      "save": {
        "ability": "Constitution",
        "damage": "14d8",
        "damageType": "necrotic",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Hail of Thorns",
      "description": "The next time you hit a creature with a ranged weapon attack before this spell ends, this spell creates a rain of thorns that sprouts from your ranged weapon or ammunition. In addition to the normal effects of the attack, the target of the attack and each creature within 5 feet of it must make a Dexterity saving throw. A creature takes 2d8 piercing damage on a failed save, or half as much damage on a successful one.",
      "higherLevel": "If you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st (to a maximum of 6d8).",
      "save": {
        "ability": "Dexterity",
        "damage": "2d8",
        "damageType": "piercing",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Heal",
      "school": "Necromancy"
    },
    {
      "name": "Healing Word",
      "description": "A creature of your choice that you can see within range regains hit points equal to 2d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
      "school": "Necromancy",
      "heal": {
        "amount": "2d4",
        "castingStat": true,
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Heat Metal",
      "description": "Choose a manufactured metal object, such as a metal weapon or a suit of heavy or medium metal armor, that you can see within range. You cause the object to glow red-hot. Any creature in physical contact with the object takes 2d6 fire damage when you cast the spell. Until the spell ends, you can use a bonus action on each of your subsequent turns to cause this damage again.\nIf a creature is holding or wearing the object and takes the damage from it, the creature must succeed on a Constitution saving throw or drop the object if it can. If it doesn't drop the object, it has disadvantage on attack rolls and ability checks until the start of your next turn.",
      "save": {
        "ability": "Wisdom",
        "damage": "2d8",
        "damageType": "fire",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Hold Monster",
      "newName": "Hold Creature"
    },
    {
      "name": "Hold Person",
      "remove": true
    },
    {
      "name": "Hunger of Hadar",
      "description": "You open a gateway to the dark between the stars, a region infested with unknown horrors. A 20-foot-radius sphere of blackness and bitter cold appears, centered on a point with range and lasting for the duration. This void is filled with a cacophony of soft whispers and slurping noises that can be heard up to 30 feet away. No light, magical or otherwise, can illuminate the area, and creatures fully within the area are blinded.\nThe void creates a warp in the fabric of space, and the area is difficult terrain. Any creature that starts its turn in the area takes 2d6 cold damage. Any creature that ends its turn in the area must succeed on a Dexterity saving throw or take 4d6 acid damage as milky, otherworldly tentacles rub against it.",
      "higherLevel": "When you cast this spell using a spell slot of 4th level or higher, the base damage increases by 1d6 for each slot level above 3rd.",
      "save": {
        "ability": "Dexterity",
        "damage": "4d6",
        "damageType": "acid",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Hydraulic Push",
      "description": "You summon a blast of water that soaks one creature or square. Make a ranged spell attack against a creature, if it hits the creature takes 1d8 bludgeoning damage and is pushed back 10 feet. This spells also extinguishes any normal fire on a creature or object, or in a 5-foot square. Magical fire is unaffected.",
      "higherLevel": "This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
      "emote": "summons a blast of water that soaks a creature",
      "source": "houserules",
      "range": "30 ft",
      "target": "a creature that you can see within range",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "castingTime": "1 action",
      "duration": "Instantaneous",
      "level": 0,
      "school": "Evocation",
      "attack": {
        "type": "ranged",
        "damage": "((@{level} + 1) / 6 + 0.5)d8",
        "damageType": "bludgeoning"
      },
      "classes": [
        "Druid",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Ice Slick",
      "description": "You create a blast of intense cold, coating all solid surfaces in the area with a thin layer of ice from a point of your choice within range. Each creature in a 10-foot-radius sphere centered on that point must make a Dexterity saving throw. A creature takes takes 3d8 cold damage and falls prone on a failed save, or half as much on a successful one.\nA creature that enters the area or ends its turn there must also succeed on a Dexterity saving throw or fall prone.\nA 5-foot square of ice has 3 hit points. The ice is an instantaneous effect, but persists as non-magical ice. Under temperate conditions, the ice lasts 1 minute. In tropical environments, it might last only half as long. In cold environments where ice and snow persist without melting, it could last indefinitely.",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd",
      "emote": "evokes a blast of intense cold, coating all solid surfaces in the area with a thin layer of ice",
      "source": "houserules",
      "range": "30 ft",
      "target": "each creature in the aoe",
      "aoe": "10 ft radius sphere centered on a point within range",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "1 minute",
      "castingTime": "1 action",
      "level": 2,
      "school": "Evocation",
      "save": {
        "ability": "Dexterity",
        "damage": "3d8",
        "damageType": "cold",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Druid",
        "Ranger",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Ice Spears",
      "description": "Upon casting this spell, three giant spears of ice lance up out of the ground. Each stalagmite-like icicle affects a 5-foot square and tapers to a height of 10 feet. Each creature that occupies a square from which a spear extends must make a Dexterity saving throw or take 3d6 piercing damage and 3d6 cold damage and be knocked prone. A creature that succeeds on its saving throw takes half damage and isn't knocked prone.\nIce spears created by this spell persist. They melt as normal depending on the surrounding environment. They can provide cover. An ice spear has 12 AC and 30 hit points.",
      "higherLevel": "When you cast this spell using a spell slot of 4th level or higher, the number of spears increases by 1 for every two slot levels above 3rd",
      "emote": "evokes giant spears of ice that lance up out of the ground.",
      "source": "houserules",
      "range": "60 ft",
      "target": "each creature occupying a square with a stalagmite spear",
      "aoe": "3 spears",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a small stalagmite shaped crystal"
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 3,
      "school": "Evocation",
      "save": {
        "ability": "Dexterity",
        "damage": "3d6",
        "damageType": "piercing",
        "secondaryDamage": "3d6",
        "secondaryDamageType": "cold",
        "saveSuccess": "half damage"
      },
      "classes": [
        "Druid",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Identify",
      "remove": true
    },
    {
      "name": "Illusion of Calm",
      "description": "You create an illusory double that takes the same space as you. That double makes it look like you are standing still, even when you are not. While under the effects of this spell, your movement doesn't provoke opportunity attacks.\nWhen a creature hits you with an attack, it can make an Intelligence saving throw. On a successful saving throw, it successfully disbelieves and the spell's effect ends for that creature.",
      "emote": "creates an illusory double",
      "range": "Self",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "up to 1 minute",
      "concentration": true,
      "castingTime": "1 action",
      "level": 1,
      "school": "Illusion",
      "classes": [
        "Bard",
        "Sorcerer",
        "Warlock",
        "Wizard"
      ]
    },
    {
      "name": "Immolation",
      "description": "Flames wreathe one creature you can see within range. The target must make a Dexterity saving throw. It takes 9d6 fire damage on a failed save, or half as much damage on a successful one. On a failed save, the target also burns for the spell's duration. The burning target sheds bright light in a 30-foot radius and dim light for an additional 30 feet. At the end of each of its turns, the target repeats the saving throw. It takes 11d6 fire damage on a failed save, and the spell ends on a successful one. These magical flames can't be extinguished through nonmagical means.\nIf damage from this spell reduces a target to 0 hit points, the target is turned to ash.",
      "higherLevel": "When you cast this spell using a spell slot of 6th level or higher, the base damage increases by 1d6 for each slot level above 5th.",
      "save": {
        "ability": "Dexterity",
        "damage": "9d6",
        "damageType": "fire",
        "higherLevelDice": "1",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Imprisonment",
      "description": "You create a magical restraint to hold a creature that you can see within range. The target must succeed on the appropriate saving throw or be bound by the spell; if it succeeds, it is immune to this spell if you cast it again. While affected by this spell, the creature doesn't need to breathe, eat, or drink, and it doesn't age. Divination spells can't locate or perceive the target.\nWhen you cast the spell, you choose one of the following forms of imprisonment.\nBurial. The target succeed on a Strength saving throw or be entombed far beneath the earth in a sphere of magical force that is just large enough to contain the target. Nothing can pass through the sphere, nor can any creature teleport or use planar travel to get into or out of it.\nThe special component for this version of the spell is a small mithral orb.\nChaining. The target succeed on a Strength saving throw or heavy chains, firmly rooted in the ground, hold the target in place. The target is restrained until the spell ends, and it can't move or be moved by any means until then.\nThe special component for this version of the spell is a fine chain of precious metal.\nHedged Prison. The target succeed on a Charisma saving throw or be transported into a tiny demiplane that is warded against teleportation and planar travel. The demiplane can be a labyrinth, a cage, a tower, or any similar confined structure or area of your choice.\nThe special component for this version of the spell is a miniature representation of the prison made from jade.\nMinimus Containment. The target succeed on an Constitution saving throw or shrink to a height of 1 inch and is imprisoned inside a gemstone or similar object. Light can pass through the gemstone normally (allowing the target to see out and other creatures to see in), but nothing else can pass through, even by means of teleportation or planar travel. The gemstone can't be cut or broken while the spell remains in effect.\nThe special component for this version of the spell is a large, transparent gemstone, such as a corundum, diamond, or ruby.\nSlumber. The target succeed on a Wisdom  saving throw or fall asleep and can't be awoken.\nThe special component for this version of the spell consists of rare soporific herbs.\nEnding the Spell. During the casting of the spell, in any of its versions, you can specify a condition that will cause the spell to end and release the target. The condition can be as specific or as elaborate as you choose, but the DM must agree that the condition is reasonable and has a likelihood of coming to pass. The conditions can be based on a creature's name, identity, or deity but otherwise must be based on observable actions or qualities and not based on intangibles such as level, class, or hit points.\nA dispel magic spell can end the spell only if it is cast as a 9th-level spell, targeting either the prison or the special component used to create it.\nYou can use a particular special component to create only one prison at a time. If you cast the spell again using the same component, the target of the first casting is immediately freed from its binding."
    },
    {
      "name": "Incendiary Cloud",
      "description": "A swirling cloud of smoke shot through with white-hot embers appears in a 20-foot-radius sphere centered on a point within range. The cloud spreads around corners and is heavily obscured. It lasts for the duration or until a wind of moderate or greater speed (at least 10 miles per hour) disperses it.\nWhen the cloud appears, each creature in it must make a Dexterity saving throw. A creature takes 12d8 fire damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw when it enters the spell's area for the first time on a turn or starts its turn there.\nThe cloud moves 10 feet directly away from you in a direction that you choose at the start of each of your turns.",
      "higherLevel": "When you cast this spell using a spell slot of 9th level, the damage increases by 1d8.",
      "save": {
        "ability": "Dexterity",
        "damage": "12d8",
        "damageType": "fire",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Insect Plague",
      "description": "Swarming, biting locusts fill a 20-foot-radius sphere centered on a point you choose within range. The sphere spreads around corners. The sphere remains for the duration, and its area is lightly obscured. The sphere's area is difficult terrain.\nWhen the area appears, each creature in it must make a Constitution saving throw. A creature takes 5d10 piercing damage on a failed save, or half as much damage on a successful one. A creature must also make this saving throw when it enters the spell's area for the first time on a turn or ends its turn there.",
      "save": {
        "ability": "Constitution",
        "damage": "5d10",
        "damageType": "piercing",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Investiture of Flame",
      "description": "Flames race across your body, shedding bright light in a 30-foot radius and dim light for an additional 30 feet for the spell's duration. The flames don't harm you. Until the spell ends, you gain the following benefits:\n- You are immune to fire damage and have resistance to cold damage.\n- Any creature that moves within 5 feet of you for the first time on a turn or ends its turn there takes 1d10 fire damage.\n- You can use your action to create a line of fire 30 feet long and 5 feet wide extending from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 6d6 fire damage on a failed save, or half as much damage on a successful one.",
      "higherLevel": "When you cast this spell using a spell slot of 7th level or higher, the line of fire damage increases by 1d6 for each slot level above 6th."
    },
    {
      "name": "Investiture of Ice",
      "description": "Until the spell ends, ice rimes your body, and you gain the following benefits:\n- You are immune to cold damage and have resistance to fire damage.\n- You can move across difficult terrain created by ice or snow without spending extra movement.\n- The ground in a 10-foot radius around you is icy and is difficult terrain for creatures other than you. The radius moves with you.\n- You can use your action to create a 30-foot cone of freezing wind extending from your outstretched hand in a direction you choose. Each creature in the cone must make a Constitution saving throw. A creature takes 5d6 cold damage on a failed save, or half as much damage on a successful one. A creature that fails its save against this effect has its speed halved until the start of your next turn.",
      "higherLevel": "When you cast this spell using a spell slot of 7th level or higher, the cone of cold damage increases by 1d6 for each slot level above 6th."
    },
    {
      "name": "Investiture of Stone",
      "description": "Until the spell ends, bits of rock spread across your body, and you gain the following benefits:\n- You have resistance to bludgeoning, piercing, and slashing damage from nonmagical weapons.\n- You can use your action to create a small earthquake on the ground in a 15-foot radius centered on you. Other creatures on that ground must make a Dexterity saving throw. A creature takes 5d6 bludgeoning damage and is knocked prone on a failed save, or half as much damage and not knocked prone on a successful one.\n- You can move across difficult terrain made of earth or stone without spending extra movement. You can move through solid earth or stone as if it was air and without destabilizing it, but you can't end your movement there. If you do so, you are ejected to the nearest unoccupied space, this spell ends, and you are stunned until the end of your next turn.",
      "higherLevel": "When you cast this spell using a spell slot of 7th level or higher, the wind damage increases by 1d8 for each slot level above 6th."
    },
    {
      "name": "Investiture of Wind",
      "description": "Until the spell ends, wind whirls around you, and you gain the following benefits:\n- Ranged weapon attacks made against you have disadvantage on the attack roll.\n- You gain a flying speed of 60 feet. If you are still flying when the spell ends, you fall, unless you can somehow prevent it.\n- You can use your action to create a 10-foot radius of swirling wind centered on a point you can see within 60 feet of you. Each creature in that area must make a Strength saving throw. A creature takes 4d8 bludgeoning damage on a failed save, or half as much damage on a successful one. If a Large or smaller creature fails the save, that creature is also pushed up to 10 feet away from the center of the radius.",
      "higherLevel": "When you cast this spell using a spell slot of 7th level or higher, the wind damage increases by 1d8 for each slot level above 6th."
    },
    {
      "name": "Jump",
      "remove": true
    },
    {
      "name": "Levitate",
      "description": "One creature or object of your choice that you can see within range rises vertically, up to 20 feet, and remains suspended there for the duration. The spell can levitate a target that weighs up to 500 pounds. An unwilling creature that succeeds on a Strength saving throw is unaffected.\nThe target can move only by pushing or pulling against a fixed object or surface within reach (such as a wall or a ceiling), which allows it to move as if it were climbing. You can change the target's altitude by up to 20 feet in either direction on your turn. If you are the target, you can move up or down as part of your move. Otherwise, you can use your action to move the target, which must remain within the spell's range.\nWhen the spell ends, the target floats gently to the ground if it is still aloft.",
      "save": {
        "ability": "Strength"
      }
    },
    {
      "name": "Lightning Arc",
      "description": "You generate an arc of lightning between two targets that are no more than 60 feet apart. Both targets and any creatures in a line connecting them must make a Dexterity saving throw. A creature takes 8d8 lightning damage on a failed save, or half as much damage on a successful one. The spell fails if there is no line of effect between the targets. Lightning arc sets fire to combustibles and damages objects in its path. It can melt metals that have a low melting point, such as lead, gold, copper, silver, or bronze.",
      "higherLevel": "When you cast this spell using a spell slot of 6th level or higher, the damage increases by 1d8 for each slot level above 5th.",
      "emote": "generates an arc of lightning between two targets",
      "source": "houserules",
      "range": "120 ft",
      "target": "Both targets and any creatures in the aoe",
      "aoe": "line connecting the targets",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 5,
      "school": "Evocation",
      "save": {
        "ability": "Dexterity",
        "damage": "8d8",
        "damageType": "lightning",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      },
      "classes": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Lightning Arrow",
      "description": "The next time you make a ranged weapon attack during the spell's duration, the weapon's ammunition, or the weapon itself if it's a thrown weapon, transforms into a bolt of lightning. Make the attack roll as normal. The target takes 4d8 lightning damage on a hit, or half as much damage on a miss, instead of the weapon's normal damage.\nWhether you hit or miss, each creature within 10 feet of the target must make a Dexterity saving throw. Each of these creatures takes 3d8 lightning damage on a failed save, or half as much damage on a successful one.\nThe piece of ammunition or weapon then returns to its normal form.",
      "save": {
        "ability": "Dexterity",
        "damage": "3d8",
        "damageType": "lightning",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Lightning Bolt",
      "description": "A stroke of lightning forming a line 100 feet long and 5 feet wide blasts out from you in a direction you choose. Each creature in the line must make a Dexterity saving throw. A creature takes 6d6 lightning damage on a failed save, or half as much damage on a successful one.\nThe lightning ignites flammable objects in the area that aren't being worn or carried.",
      "save": {
        "ability": "Dexterity",
        "damage": "6d6",
        "damageType": "lightning",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Lightning Lure",
      "description": "You create a lash of lightning energy that strikes at one creature of your choice that you can see within range. The target must succeed on a Strength saving throw or be pulled up to 10 feet in a straight line toward you and then take 1d12 lightning damage if it is within 5 feet of you.",
      "higherLevel": "This spell's damage increases by 1d12 when you reach 5th level (2d12), 11th level (3d12), and 17th level (4d12).",
      "save": {
        "ability": "Strength",
        "damage": "((@{level} + 1) / 6 + 0.5)d12",
        "damageType": "lightning"
      }
    },
    {
      "name": "Locate Creature",
      "ritual": true
    },
    {
      "name": "Locate Object",
      "ritual": true
    },
    {
      "name": "Longstrider",
      "newName": "Striding and Springing",
      "description": "You touch a creature. The target's speed increases by 10 feet until the spell ends. In addition, the target can jump three times their normal distance, though they can't jump farther than their remaining movement would allow.",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a pinch of dirt and a grasshopper's hind leg"
      },
      "duration": "1 hour"
    },
    {
      "name": "Maelstrom",
      "description": "A mass of 5-foot-deep water appears and swirls in a 30-foot radius centered on a point you can see within range. The point must be on ground or in a body of water. Until the spell ends, that area is difficult terrain, and any creature that starts its turn there must succeed on a Strength saving throw or take 8d6 bludgeoning damage and be pulled 10 feet toward the center.",
      "higherLevel": "When you cast this spell using a spell slot of 6th level or higher, the base damage increases by 1d6 for each slot level above 5th.",
      "school": "Evocation",
      "save": {
        "ability": "Strength",
        "damage": "8d6",
        "damageType": "bludgeoning",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Make Whole",
      "description": "An object or construct creature up 20 cubic feet within 30 feet regains a number of hit points equal to 2d6. This can fix destroyed magic items (at 0 hit points or less), and restores the magic properties of the item if your caster level is at least twice that of the item. Items with charges (such as wands) and single-use items (such as potions and scrolls) cannot be repaired in this way. The spell does not repair items that have been warped, burned, disintegrated, ground to powder, melted, or vaporized, nor does it affect creatures (including constructs).",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the target cubic foot range adds 10 cubic feet and the healing increases by 1d6 for each slot level above 2nd.",
      "emote": "repairs an object",
      "source": "houserules",
      "range": "30 ft",
      "target": "an object or construct creature up 20 cubic ft within range",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a large lodestone"
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 2,
      "school": "Transmutation",
      "heal": {
        "amount": "2d6",
        "higherLevelDice": "1"
      },
      "classes": [
        "Cleric",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Mass Cure Wounds",
      "school": "Necromancy"
    },
    {
      "name": "Mass Heal",
      "school": "Necromancy"
    },
    {
      "name": "Mass Healing Word",
      "description": "As you call out words of restoration, up to six creatures of your choice that you can see within range regain hit points equal to 2d4 + your spellcasting ability modifier. This spell has no effect on undead or constructs.",
      "school": "Necromancy",
      "heal": {
        "amount": "2d4",
        "castingStat": true,
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Maximilian's Earthen Grasp",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the base damage increases by 1d6 for each slot level above 2nd.",
      "save": {
        "ability": "Strength",
        "damage": "2d6",
        "damageType": "bludgeoning",
        "higherLevelDice": "1",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Meld into Stone",
      "ritual": false
    },
    {
      "name": "Melf's Acid Arrow",
      "description": "A shimmering green arrow streaks toward a target within range and bursts in a spray of acid. Make a ranged spell attack against the target. On a hit, the target takes 5d4 acid damage immediately and 5d4 acid damage at the end of its next turn. On a miss, the arrow splashes the target with acid for half as much of the initial damage and no damage at the end of its next turn.",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the damage (both initial and later) increases by 2d4 for each slot level above 2nd.",
      "attack": {
        "type": "ranged",
        "damage": "5d4",
        "damageType": "acid",
        "secondaryDamage": "5d4",
        "secondaryDamageType": "acid",
        "higherLevelDice": "2",
        "higherLevelSecondaryDice": "2",
        "higherLevelSecondaryDie": "d4"
      },
      "classes": [
        "Druid",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Memory of Function",
      "description": "You restore a broken item, or damaged robot or construct, to a functional state, as if it were new and intact. Any pieces missing from the item or construct remain missing. Significant missing pieces may prevent proper functioning. If the item uses charges, the item becomes fully charged.\nA timeworn item becomes fully charged, but doesn’t lose the timeworn condition (this spell is one of the few ways a timeworn item can be recharged). For 1 hour after this spell is cast on a timeworn item, that item does not suffer any chance of glitching. Other consumables such as ammunition are not restored.\nWhen this spell is cast upon a damaged robot or construct, all hit point damage dealt to that creature is healed. When this spell is cast upon a destroyed robot or construct, it is restored to full functionality and full hit points, provided no significant portion of the destroyed construct (such as an entire limb) is missing. Robots and constructs brought back in this fashion regain their memories up to the moment of their destruction and have no particular inclination to serve the caster.",
      "emote": "restores a broken item, or damaged robot or construct, to a functional state",
      "source": "houserules",
      "range": "Touch",
      "target": "a broken item, or damaged robot or construct",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "powdered skymetal worth at least 1,000 gp, which the spell consumes"
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 7,
      "school": "Transmutation",
      "classes": [
        "Cleric",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Meteor Swarm",
      "description": "Blazing orbs of fire plummet to the ground at four different points you can see within range. Each creature in a 40-foot-radius sphere centered on each point you choose must make a Dexterity saving throw. The sphere spreads around corners. A creature takes 15d6 fire damage and 15d6 bludgeoning damage on a failed save, or half as much damage on a successful one. A creature in the area of more than one fiery burst is affected only once.\nThe spell damages objects in the area and ignites flammable objects that aren't being worn or carried.",
      "save": {
        "ability": "Dexterity",
        "damage": "15d6",
        "damageType": "fire",
        "secondaryDamage": "15d6",
        "secondaryDamageType": "bludgeoning",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Miasmatic Form",
      "description": "You transform a willing creature you touch, along with everything it's wearing and carrying, into a misty cloud for the duration. The spell ends if the creature drops to 0 hit points. An incorporeal creature isn't affected.\nWhile in this form, the target's only method of movement is a flying speed of 10 feet. The target can enter and occupy the space of another creature. The target's body nauseates creatures. Each creature that is completely within the cloud at the start of its turn must make a Constitution saving throw against poison. On a failed save, the creature spends its action that turn retching and reeling. Creatures that don't need to breathe or are immune to poison automatically succeed on this saving throw. The target has resistance to nonmagical damage, and it has advantage on Strength, Dexterity, and Constitution saving throws. The target can pass through small holes, narrow openings, and even mere cracks, though it treats liquids as though they were solid surfaces. The target can't fall and remains hovering in the air even when stunned or otherwise incapacitated.\nWhile in the form of a misty cloud, the target can't talk or manipulate objects, and any objects it was carrying or holding can't be dropped, used, or otherwise interacted with. The target can't attack or cast spells.",
      "emote": "transforms a creature, along with everything it's wearing and carrying, into a misty cloud ",
      "source": "houserules",
      "range": "Touch",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a bit of gauze and a wisp of smoke"
      },
      "duration": "up to 1 minute",
      "concentration": true,
      "castingTime": "1 action",
      "level": 3,
      "school": "Transmutation",
      "save": {
        "ability": "Constitution"
      },
      "classes": [
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Moonbeam",
      "description": "A silvery beam of pale light shines down in a 5-foot-radius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder.\nWhen a creature enters the spell's area for the first time on a turn or starts its turn there, it is engulfed in ghostly flames that cause searing pain, and it must make a Constitution saving throw. It takes 2d8 radiant damage on a failed save, or half as much damage on a successful one.\nA shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its original form and can't assume a different form until it leaves the spell's light.\nOn each of your turns after you cast this spell, you can use an action to move the beam 60 feet in any direction.",
      "higherLevel": "When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1d8 for each slot level above 2nd.",
      "save": {
        "ability": "Constitution",
        "damage": "2d8",
        "damageType": "radiant",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Mordenkainen's Faithful Hound",
      "description": "You conjure a phantom watchdog in an unoccupied space that you can see within range, where it remains for the duration, until you dismiss it as an action, or until you move more than 100 feet away from it.\nThe hound is invisible to all creatures except you and can't be harmed. When a Small or larger creature comes within 30 feet of it without first speaking the password that you specify when you cast this spell, the hound starts barking loudly. The hound sees invisible creatures and can see into the Ethereal Plane. It ignores illusions.\nAt the start of each of your turns, the hound attempts to bite one creature within 5 feet of it that is hostile to you. The hound's attack bonus is equal to your spellcasting ability modifier + your proficiency bonus. On a hit, it deals 6d8 piercing damage.",
      "attack": {
        "damage": "6d8",
        "damageType": "piercing",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Mordenkainen's Sword",
      "description": "You create a sword-shaped plane of force that hovers within range. It lasts for the duration.\nWhen the sword appears, you make a melee spell attack against a target of your choice within 5 feet of the sword. On a hit, the target takes 5d10 force damage. Until the spell ends, you can use a bonus action on each of your turns to move the sword up to 20 feet to a spot you can see and repeat this attack against the same target or a different one.",
      "level": 6,
      "attack": {
        "type": "melee",
        "damage": "5d10",
        "damageType": "force"
      }
    },
    {
      "name": "Nondetection",
      "higherLevel": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd."
    },
    {
      "name": "Pass without Trace",
      "description": "A veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has advantage on Dexterity (Stealth) checks and can't be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage."
    },
    {
      "name": "Phantom Steed",
      "higherLevel": "When you cast this spell using a spell slot of 4th level or higher, you can create one additional steed for each slot level above 3nd. When you use a spell of 4th level or higher, the steeds can ride over sandy, muddy, or even swampy ground without difficulty or a decrease in speed. When you use a spell of 5th level or higher, the steeds can walk on water (per the water walk spell). When you use a spell of 6th level or higher, the steeds can fly at its speed for up to 1 round, after which it falls to the ground. When you use a spell of 7th level or higher, the steeds can fly at its speed.",
      "school": "Conjuration",
      "ritual": false
    },
    {
      "name": "Poison Spray",
      "description": "You extend your hand toward a creature you can see within range and project a puff of noxious gas from your palm. The target must make a Constitution saving throw. The target takes 1d10 poison damage on a failed save, or half as much damage on a successful one.",
      "higherLevel": "This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
      "save": {
        "ability": "Constitution",
        "damage": "((@{level} + 1) / 6 + 0.5)d10",
        "damageType": "poison",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Poisoning Touch",
      "description": "You sicken a creature's body. The target must make a Constitution saving throw or be poisoned until the end of your next turn.",
      "emote": "sickens a creature's body",
      "range": "15 ft.",
      "target": "a creature",
      "components": {
        "verbal": true,
        "somatic": true,
        "material": true,
        "materialMaterial": "a drop of sweat"
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 0,
      "school": "Necromancy",
      "save": {
        "ability": "Constitution"
      },
      "classes": [
        "Druid",
        "Cleric",
        "Sorcerer",
        "Wizard"
      ]
    },

    {
      "name": "Polymorph",
      "description": "This spell transforms a creature that you can see within range into a new form. An unwilling creature must make a Wisdom saving throw to avoid the effect. A shapechanger automatically succeeds on this saving throw.\nThe transformation lasts for the duration, or until the target drops to 0 hit points or dies. The new form can be any beast whose challenge rating is equal to or less than the target's (or the target's level, if it doesn't have a challenge rating). The target's game statistics, including mental ability scores, are replaced by the statistics of the chosen beast. It retains its alignment and personality.\nThe target assumes the hit points of its new form. When it reverts to its normal form, the creature returns to the number of hit points it had before it transformed. If it reverts as a result of dropping to 0 hit points, any excess damage carries over to its normal form. As long as the excess damage doesn't reduce the creature's normal form to 0 hit points, it isn't knocked unconscious.\nThe creature is limited in the actions it can perform by the nature of its new form, and it can't speak, cast spells, or take any other action that requires hands or speech.\nThe target's gear melds into the new form. The creature can't activate, use, wield, or otherwise benefit from any of its equipment. At the end of each of its turns, the target can make another Wisdom saving throw. On a success, the spell ends on the target."
    },
    {
      "name": "Power Word Heal",
      "school": "Necromancy"
    },
    {
      "name": "Prayer of Healing",
      "school": "Necromancy"
    },
    {
      "name": "Prismatic Spray",
      "description": "Eight multicolored rays of light flash from your hand. Each ray is a different color and has a different power and purpose. Each creature in a 60-foot cone must make a Dexterity saving throw. For each target, roll a d8 to determine which color ray affects it.\n1. Red. The target takes 12d6 fire damage on a failed save, or half as much damage on a successful one.\n2. Orange. The target takes 12d6 acid damage on a failed save, or half as much damage on a successful one.\n3. Yellow. The target takes 12d6 lightning damage on a failed save, or half as much damage on a successful one.\n4. Green. The target takes 12d6 poison damage on a failed save, or half as much damage on a successful one.\n5. Blue. The target takes 12d6 cold damage on a failed save, or half as much damage on a successful one.\n6. Indigo. On a failed save, the target is restrained. It must then make a Constitution saving throw at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures don't need to be consecutive; keep track of both until the target collects three of a kind.\n7. Violet. On a failed save, the target is blinded. It must then make a Charisma saving throw at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of existence of the DM's choosing and is no longer blinded. (Typically, a creature that is on a plane that isn't its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes.)\n8. Special. The target is struck by two rays. Roll twice more, rerolling any 8.",
      "higherLevel": "When you cast this spell using a spell slot of 7th level or higher, the damage increases by 1d6 for each slot level above 6th.",
      "level": 6,
      "save": {
        "ability": "Dexterity",
        "damage": "12d6",
        "damageType": "fire, acid, lightning, poison, or cold",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Prismatic Wall",
      "description": "A shimmering, multicolored plane of light forms a vertical opaque wall—up to 90 feet long, 30 feet high, and 1 inch thick—centered on a point you can see within range. Alternatively, you can shape the wall into a sphere up to 30 feet in diameter centered on a point you choose within range. The wall remains in place for the duration. If you position the wall so that it passes through a space occupied by a creature, the spell fails, and your action and the spell slot are wasted.\nThe wall sheds bright light out to a range of 100 feet and dim light for an additional 100 feet. You and creatures you designate at the time you cast the spell can pass through and remain near the wall without harm. If another creature that can see the wall moves to within 20 feet of it or starts its turn there, the creature must succeed on a Constitution saving throw or become blinded for 1 minute.\nThe wall consists of seven layers, each with a different color. When a creature attempts to reach into or pass through the wall, it does so one layer at a time through all the wall's layers. As it passes or reaches through each layer, the creature must make a Dexterity saving throw or be affected by that layer's properties as described below.\nThe wall can be destroyed, also one layer at a time, in order from red to violet, by means specific to each layer. Once a layer is destroyed, it remains so for the duration of the spell. A rod of cancellation destroys a prismatic wall, but an antimagic field has no effect on it.\n1. Red. The creature takes 10d6 fire damage on a failed save, or half as much damage on a successful one. While this layer is in place, nonmagical ranged attacks can't pass through the wall. The layer can be destroyed by dealing at least 25 cold damage to it.\n2. Orange. The creature takes 10d6 acid damage on a failed save, or half as much damage on a successful one. While this layer is in place, magical ranged attacks can't pass through the wall. The layer is destroyed by a strong wind.\n3. Yellow. The creature takes 10d6 lightning damage on a failed save, or half as much damage on a successful one. This layer can be destroyed by dealing at least 60 force damage to it.\n4. Green. The creature takes 10d6 poison damage on a failed save, or half as much damage on a successful one. A passwall spell, or another spell of equal or greater level that can open a portal on a solid surface, destroys this layer.\n5. Blue. The creature takes 10d6 cold damage on a failed save, or half as much damage on a successful one. This layer can be destroyed by dealing at least 25 fire damage to it.\n6. Indigo. On a failed save, the creature is restrained. It must then make a Constitution saving throw at the end of each of its turns. If it successfully saves three times, the spell ends. If it fails its save three times, it permanently turns to stone and is subjected to the petrified condition. The successes and failures don't need to be consecutive; keep track of both until the creature collects three of a kind.\nWhile this layer is in place, spells can't be cast through the wall. The layer is destroyed by bright light shed by a daylight spell or a similar spell of equal or higher level.\n7. Violet. On a failed save, the creature is blinded. It must then make a Charisma saving throw at the start of your next turn. A successful save ends the blindness. If it fails that save, the creature is transported to another plane of the DM's choosing and is no longer blinded. (Typically, a creature that is on a plane that isn't its home plane is banished home, while other creatures are usually cast into the Astral or Ethereal planes.) This layer is destroyed by a dispel magic spell or a similar spell of equal or higher level that can end spells and magical effects."
    },
    {
      "name": "Produce Flame",
      "description": "A flickering flame appears in your hand. The flame remains there for the duration and harms neither you nor your equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again.\nYou can also attack with the flame, although doing so ends the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell attack. On a hit, the target takes 1d10 fire damage.",
      "higherLevel": "This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
      "attack": {
        "type": "ranged",
        "damage": "((@{level} + 1) / 6 + 0.5)d10",
        "damageType": "fire"
      }
    },
    {
      "name": "Protection from Energy",
      "description": "For the duration, up to two willing creatures you touch have resistance to one damage type of your choice: acid, cold, fire, lightning, or thunder.",
      "higherLevel": "When you cast this spell using a spell slot of 4th level or higher, you can target one additional creature for each slot level above 3rd.",
      "target": "up to 2 willing creatures"
    },
    {
      "name": "Rary's Telepathic Bond",
      "ritual": false
    },
    {
      "name": "Ray of Enfeeblement",
      "description": "A black beam of enervating energy springs from your finger toward a creature within range. Make a ranged spell attack against the target. On a hit, the target has disadvantage on ability checks, attack rolls, and saving throws that use Strength and deals only half damage with weapon attacks that use Strength until the spell ends.\nAt the end of each of the target's turns, it can make a Constitution saving throw against the spell. On a success, the spell ends.",
      "level": 1
    },
    {
      "name": "Ray of Frost",
      "range": "90 ft"
    },
    {
      "name": "Ray of Sickness",
      "description": "A ray of sickening greenish energy lashes out toward a creature within range. Make a ranged spell attack against the target. On a hit, the target takes 3d8 poison damage and must make a Constitution saving throw. On a failed save, it is also poisoned until the end of your next turn.",
      "attack": {
        "type": "ranged",
        "damage": "3d8",
        "damageType": "poison",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Regenerate",
      "school": "Necromancy"
    },
    {
      "name": "Sacred Flame",
      "description": "Flame-like radiance descends on a creature that you can see within range. The target must make a Dexterity saving throw. The target takes 1d8 radiant damage on a failed save, or half as much damage on a successful one. The target gains no benefit from cover for this saving throw.",
      "save": {
        "ability": "Dexterity",
        "damage": "((@{level} + 1) / 6 + 0.5)d8",
        "damageType": "radiant",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Searing Smite",
      "description": "The next time you hit a creature with a melee weapon attack during the spell's duration, your weapon flares with white-hot intensity, and the attack deals an extra 2d6 fire damage to the target and causes the target to ignite in flames. At the start of each of its turns until the spell ends, the target must make a Constitution saving throw. On a failed save, it takes 1d6 fire damage. On a successful save, the spell ends. If the target or a creature within 5 feet of it uses an action to put out the flames, or if some other effect douses the flames (such as the target being submerged in water), the spell ends.",
      "damage": {
        "damage": "2d6",
        "damageType": "fire",
        "secondaryDamage": "1d6",
        "secondaryDamageType": "fire",
        "higherLevelDice": "1",
        "higherLevelSecondaryDice": "0.49",
        "higherLevelSecondaryDie": "d6"
      }
    },
    {
      "name": "Sending",
      "level": 2
    },
    {
      "name": "Shocking Grasp",
      "description": "Lightning springs from your hand to deliver a shock to a creature you try to touch. Make a melee spell attack against the target. You have advantage on the attack roll if the target is wearing armor made of metal. On a hit, the target takes 1d10 lightning damage, and it can't take reactions until the start of its next turn.",
      "higherLevel": "The spell's damage increases by 1d8 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
      "attack": {
        "type": "melee",
        "damage": "((@{level} + 1) / 6 + 0.5)d10",
        "damageType": "lightning"
      }
    },
    {
      "name": "Shield",
      "description": "An invisible barrier of magical force appears and protects you. Until the start of your next turn, you have a +3 bonus to AC, including against the triggering attack, and you take no damage from magic missile.",
      "higherLevel": "When you cast this spell using a spell slot of 2nd level or higher, the spell's AC bonus increases by +1 for each slot level above 1st (up to a maximum of +5 AC total)."
    },
    {
      "name": "Slow",
      "save": {
        "ability": "Constitution"
      }
    },
    {
      "name": "Snilloc's Snowball Swarm",
      "description": "A flurry of magic snowballs erupts from a point you choose within range. Each creature in a 5-foot-radius sphere centered on that point must make a Dexterity saving throw. A creature takes 3d6 cold damage and its speed is reduced by 10 feet until the start of your next turn on a failed save, or half as much damage and no reduction of speed on a successful one."
    },
    {
      "name": "Speak with Dead",
      "level": 2
    },
    {
      "name": "Speak with Plants",
      "level": 2
    },
    {
      "name": "Spider Climb",
      "higherLevel": "When you cast this spell using a spell slot of 2nd level or higher, you can affect one additional beast for each slot level above 1st.",
      "level": 1
    },
    {
      "name": "Staggering Smite",
      "description": "The next time you hit a creature with a melee weapon attack during this spell's duration, your weapon pierces both body and mind, and the attack deals an extra 4d6 psychic damage to the target. The target must make a Wisdom saving throw. On a failed save, it has disadvantage on attack rolls and ability checks, and can't take reactions, until the end of its next turn.",
      "level": 2,
      "damage": {
        "damage": "4d6",
        "damageType": "psychic",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Storm Sphere",
      "description": "A 20-foot-radius sphere of whirling air springs into existence centered on a point you choose within range. The sphere remains for the spell's duration. Each creature in the sphere when it appears or that ends its turn there must succeed on a Strength saving throw or take 4d6 bludgeoning damage. The sphere's space is difficult terrain.\nUntil the spell ends, you can use a bonus action on each of your turns to cause a bolt of lightning to leap from the center of the sphere toward one creature you choose within 60 feet of the center. Make a ranged spell attack. You have advantage on the attack roll if the target is in the sphere. On a hit, the target takes 4d6 lightning damage.\nCreatures within 30 feet of the sphere have disadvantage on Wisdom (Perception) checks made to listen.",
      "save": {
        "ability": "Strength",
        "damage": "4d6",
        "damageType": "bludgeoning",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Sword Burst",
      "description": "You create a momentary circle of spectral blades that sweep around you. Each creature within range, other than you, must succeed on a Dexterity saving throw or take 1d8 force damage.",
      "higherLevel": "This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
      "save": {
        "ability": "Dexterity",
        "damage": "((@{level} + 1) / 6 + 0.5)d8",
        "damageType": "force"
      }
    },
    {
      "name": "Symbol",
      "description": "When you cast this spell, you inscribe a harmful glyph either on a surface (such as a section of floor, a wall, or a table) or within an object that can be closed to conceal the glyph (such as a book, a scroll, or a treasure chest). If you choose a surface, the glyph can cover an area of the surface no larger than 10 feet in diameter. If you choose an object, that object must remain in its place; if the object is moved more than 10 feet from where you cast this spell, the glyph is broken, and the spell ends without being triggered.\nThe glyph is nearly invisible, requiring an Intelligence (Investigation) check against your spell save DC to find it.\nYou decide what triggers the glyph when you cast the spell. For glyphs inscribed on a surface, the most typical triggers include touching or stepping on the glyph, removing another object covering it, approaching within a certain distance of it, or manipulating the object that holds it. For glyphs inscribed within an object, the most common triggers are opening the object, approaching within a certain distance of it, or seeing or reading the glyph.\nYou can further refine the trigger so the spell is activated only under certain circumstances or according to a creature's physical characteristics (such as height or weight), or physical kind (for example, the ward could be set to affect hags or shapechangers). You can also specify creatures that don't trigger the glyph, such as those who say a certain password.\nWhen you inscribe the glyph, choose one of the options below for its effect. Once triggered, the glyph glows, filling a 60-foot-radius sphere with dim light for 10 minutes, after which time the spell ends. Each creature in the sphere when the glyph activates is targeted by its effect, as is a creature that enters the sphere for the first time on a turn or ends its turn there. \nDeath. Each target must make a Constitution saving throw, taking 10d 10 necrotic damage on a failed save, or half as much damage on a successful save.\nDiscord. Each target must make a Wisdom saving throw. On a failed save, a target bickers and argues with other creatures for 1 minute. During this time, it is incapable of meaningful communication and has disadvantage on attack rolls and ability checks.\nFear. Each target must make a Wisdom saving throw and becomes frightened for 1 minute on a failed save. While frightened, the target drops whatever it is holding and must move at least 30 feet away from the glyph on each of its turns, if able.\nHopelessness. Each target must make a Wisdom saving throw. On a failed save, the target is overwhelmed with despair for 1 minute. During this time, it can't attack or target any creature with harmful abilities, spells, or other magical effects.\nInsanity. Each target must make an Intelligence saving throw. On a failed save, the target is driven insane for 1 minute. An insane creature can't take actions, can't understand what other creatures say, can't read, and speaks only in gibberish. The DM controls its movement, which is erratic.\nPain. Each target must make a Constitution saving throw and becomes incapacitated with excruciating pain for 1 minute on a failed save.\nSleep. Each target must make a Wisdom saving throw and falls unconscious for 10 minutes on a failed save. A creature awakens if it takes damage or if someone uses an action to shake or slap it awake.\nStunning. Each target must make a Constitution saving throw and becomes stunned for 1 minute on a failed save."
    },
    {
      "name": "Thorn Whip",
      "description": "You create a long, vine-like whip covered in thorns that lashes out at your command toward a creature in range. Make a melee spell attack against the target. If the attack hits, the creature takes 1d8 piercing damage, and if the creature is Large or smaller, you pull the creature up to 10 feet closer to you.",
      "higherLevel": "This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).",
      "attack": {
        "type": "melee",
        "damage": "((@{level} + 1) / 6 + 0.5)d8",
        "damageType": "piercing"
      }
    },
    {
      "name": "Thunderbolt",
      "description": "You can command a stroke of lightning to strike down at a point within range. Each creature in a 10-foot-radius sphere centered on that point must make a Dexterity saving throw. A creature is deafened for 1 round and takes 6d6 lightning and 6d6 thunder damage on a failed save, or half as much damage on a successful one.",
      "higherLevel": "When you cast this spell using a spell slot of 5th level or higher, the lightning and the thunder damage increases by 1d6 for each slot level above 4th.",
      "emote": "calls down a stroke of lightning.",
      "source": "houserules",
      "range": "120 ft",
      "target": "Each creature in a 10-foot-radius sphere",
      "components": {
        "verbal": true,
        "somatic": true
      },
      "duration": "Instantaneous",
      "castingTime": "1 action",
      "level": 4,
      "school": "Evocation",
      "save": {
        "ability": "Dexterity",
        "damage": "6d6",
        "damageType": "lightning",
        "secondaryDamage": "6d6",
        "secondaryDamageType": "thunder",
        "saveSuccess": "half damage",
        "higherLevelDice": "1",
        "secondHigherLevelDice": "1"
      },
      "classes": [
        "Druid",
        "Sorcerer",
        "Wizard"
      ]
    },
    {
      "name": "Thunderclap",
      "description": "You create a burst of thunderous sound, which can be heard 100 feet away. Each creature other than you within 5 feet of you must make a Constitution saving throw. On a failed save, the creature takes 1d10 thunder damage.",
      "higherLevel": "The spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
      "save": {
        "ability": "Constitution",
        "damage": "((@{level} + 1) / 6 + 0.5)d10",
        "damageType": "thunder"
      }
    },
    {
      "name": "Thunderous Smite",
      "damage": {
        "damage": "2d6",
        "damageType": "thunder",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Tidal Wave",
      "description": "You conjure up a wave of water that crashes down on an area within range. The area can be up to 30 feet long, up to 10 feet wide, and up to 10 feet tall. Each creature in that area must make a Dexterity saving throw. On a failure, a creature takes 4d6 bludgeoning damage and is knocked prone. On a success, a creature takes half as much damage and isn't knocked prone. The water then spreads out across the ground in all directions, extinguishing unprotected flames in its area and within 30 feet of it.",
      "higherLevel": "When you cast this spell using a spell slot of 4th level or higher, the damage increases by 1d8 for each slot level above 3rd.",
      "save": {
        "ability": "Dexterity",
        "damage": "4d6",
        "damageType": "bludgeoning",
        "higherLevelDice": "1",
        "saveSuccess": "half damage and not knocked prone"
      }
    },
    {
      "name": "Transmute Rock",
      "description": "You choose an area of stone or mud that you can see that fits within a 40-foot cube and that is within range, and choose one of the following effects.\nTransmute Rock to Mud. Nonmagical rock of any sort in the area becomes an equal volume of thick and flowing mud that remains for the spell's duration.\nIf you cast the spell on an area of ground, it becomes muddy enough that creatures can sink into it. Each foot that a creature moves through the mud costs 4 feet of movement, and any creature on the ground when you cast the spell must make a Strength saving throw. A creature must also make this save the first time it enters the area on a turn or ends its turn there. On a failed save, a creature sinks into the mud and is restrained, though it can use an action to end the restrained condition on itself by pulling itself free of the mud.\nIf you cast the spell on a ceiling, the mud falls. Any creature under the mud when it falls must make a Dexterity saving throw. A creature takes 4d8 bludgeoning damage on a failed save, or half as much damage on a successful one.\nTransmute Mud to Rock. Nonmagical mud or quicksand in the area no more than 10 feet deep transforms into soft stone for the spell's duration. Any creature in the mud when it transforms must make a Strength saving throw. On a failed save, a creature becomes restrained by the rock. The restrained creature can use an action to try to break free by succeeding on a Strength check (DC 20) or by dealing 25 damage to the rock around it. On a successful save, a creature is shunted safely to the surface to an unoccupied space."
    },
    {
      "name": "True Strike",
      "castingTime": "1 bonus action"
    },
    {
      "name": "Vampiric Touch",
      "description": "The touch of your shadow-wreathed hand can siphon life force from others to heal your wounds. Make a melee spell attack against a creature within your reach. On a hit, the target takes 5d6 necrotic damage, and you regain hit points equal to half the amount of necrotic damage dealt. Until the spell ends, you can make the attack again on each of your turns as an action.",
      "attack": {
        "type": "melee",
        "damage": "4d6",
        "damageType": "necrotic",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Vicious Mockery",
      "description": "You unleash a string of insults laced with subtle enchantments at a creature you can see within range. If the target can hear you (though it need not understand you), it must succeed on a Wisdom saving throw or take 1d10 psychic damage and have disadvantage on the next attack roll it makes before the end of its next turn.",
      "higherLevel": "This spell's damage increases by 1d10 when you reach 5th level (2d10), 11th level (3d10), and 17th level (4d10).",
      "save": {
        "ability": "Wisdom",
        "damage": "((@{level} + 1) / 6 + 0.5)d8",
        "damageType": "psychic"
      }
    },
    {
      "name": "Wall of Sand",
      "description": "You conjure up a wall of swirling sand on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 10 feet thick, and it vanishes when the spell ends. It blocks line of sight but not movement. A creature must spend 3 feet of movement for every 1 foot it moves through the wall. Each creature within the wall when it appears, or that starts its turn in the wall, or that enters it during its turn must make a Constitution saving throw. On a failed save, the creature is blinded for 1 minute. At the end of each of its turns, a blinded target can repeat the saving throw.",
      "target": "Each creature within the wall when it appears, or that starts its turn in the wall, or that enters it during its turn",
      "save": {
        "ability": "Constitution"
      }
    },
    {
      "name": "Wall of Water",
      "description": "You conjure up a wall of water on the ground at a point you can see within range. You can make the wall up to 30 feet long, 10 feet high, and 1 foot thick, or you can make a ringed wall up to 20 feet in diameter, 20 feet high, and 1 foot thick. The wall vanishes when the spell ends.\nWhen the wall appears, each creature within its area must make a Strength saving throw. A creature takes 4d8 bludgeoning damage on a failed save, or half as much damage on a successful one.\nThe wall's space is difficult terrain.\nAny ranged weapon attack that enters the wall's space has disadvantage on the attack roll, and fire damage is halved if the fire effect passes through the wall to reach its target. Spells that deal cold damage that pass through the wall cause the area of the wall they pass through to freeze solid (at least a 5-foot square section is frozen). Each 5-foot-square frozen section has AC 5 and 15 hit points. Reducing a frozen section to 0 hit points destroys it. When a section is destroyed, the wall's water doesn't fill it.",
      "higherLevel": "When you cast this spell using a spell slot of 4th level or higher, the base damage increases by 1d6 for each slot level above 3rd.",
      "save": {
        "ability": "Strength",
        "damage": "4d8",
        "damageType": "bludgeoning",
        "higherLevelDice": "1",
        "saveSuccess": "half damage"
      }
    },
    {
      "name": "Water Breathing",
      "ritual": false,
      "duration": "2 hours"
    },
    {
      "name": "Water Walk",
      "ritual": false
    },
    {
      "name": "Whirlwind",
      "higherLevel": "When you cast this spell using a spell slot of 8th level or higher, the base damage increases by 1d6 for each slot level above 7th.",
      "save": {
        "ability": "Dexterity",
        "damage": "10d6",
        "damageType": "bludgeoning",
        "saveSuccess": "half damage",
        "higherLevelDice": "1"
      }
    },
    {
      "name": "Witch Bolt",
      "remove": true
    },
    {
      "name": "Web",
      "description": "You conjure a mass of thick, sticky webbing at a point of your choice within range. The webs fill a 20-foot cube from that point for the duration. The webs are difficult terrain and lightly obscure their area.\nIf the webs aren't anchored between two solid masses (such as walls or trees) or layered across a floor, wall, or ceiling, the conjured web collapses on itself, and the spell ends at the start of your next turn. Webs layered over a flat surface have a depth of 5 feet.\nEach creature that starts its turn in the webs or that enters them during its turn must make a Strength saving throw. On a failed save, the creature is restrained as long as it remains in the webs or until it breaks free.\nA creature restrained by the webs can use its action to make a Strength check against your spell save DC. If it succeeds, it is no longer restrained.\nThe webs are flammable. Any 5-foot cube of webs exposed to fire burns away in 1 round, dealing 2d4 fire damage to any creature that starts its turn in the fire.",
      "save": {
        "ability": "Strength"
      }
    },
    {
      "name": "Wrathful Smite",
      "damage": {
        "damage": "2d4",
        "damageType": "psychic",
        "higherLevelDice": "1"
      }
    }
  ]
}
